html/computer-science/algorithm/multiply-string.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-13 Sat 10:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Multiply String</title>
<meta name="author" content="David" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<ul class="nav">
      <li class="nav-item"><a href="/index.html">home</a></li>
      <li class="nav-item"><a href="/computer-science/index.html">computer science</a></li>
      <li class="nav-item"><a href="/life.html">life</a></li>
      <li class="nav-item"><a href="/about.html">about</a></li>
   </ul>
</div>
<div id="content" class="content">
<h1 class="title">Multiply String</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1618f70">1. Description</a>
<ul>
<li><a href="#orgd911831">1.1. Example</a></li>
<li><a href="#org6f1bb48">1.2. Constraints:</a></li>
</ul>
</li>
<li><a href="#org71c233e">2. Solution</a>
<ul>
<li><a href="#org85d918c">2.1. Code</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1618f70" class="outline-2">
<h2 id="org1618f70"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
Given two non-negative integers num1 and num2 represented as strings, return the product of num1 and num2, also represented as a string.
</p>

<p>
Note: You must not use any built-in BigInteger library or convert the inputs to integer directly.
</p>
</div>

<div id="outline-container-orgd911831" class="outline-3">
<h3 id="orgd911831"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Example 1:
</p>


<p>
Example 2:
</p>
</div>
</div>
<div id="outline-container-org6f1bb48" class="outline-3">
<h3 id="org6f1bb48"><span class="section-number-3">1.2.</span> Constraints:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>1 &lt;= num1.length, num2.length &lt;= 200</li>
<li>num1 and num2 consist of digits only.</li>
<li>Both num1 and num2 do not contain any leading zero, except the number 0 itself.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org71c233e" class="outline-2">
<h2 id="org71c233e"><span class="section-number-2">2.</span> Solution</h2>
<div class="outline-text-2" id="text-2">
<p>
The idea is to create a array to sotre all the number.
</p>

<p>
Was trying to convert the string to int. and then apply the mulply of the two number, failed with the case
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #98be65;">"123456789"</span>, <span style="color: #98be65;">"987654321"</span>
</pre>
</div>
<p>
Have to use BigInteger which is not allowed here.
</p>
</div>

<div id="outline-container-org85d918c" class="outline-3">
<h3 id="org85d918c"><span class="section-number-3">2.1.</span> Code</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Solution</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #c678dd;">multiply</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">num1</span>, <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">num2</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>num1.equals<span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"0"</span><span style="color: #a9a1e1;">)</span> || num2.equals<span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"0"</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
            <span style="color: #51afef;">return</span> <span style="color: #98be65;">"0"</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">length1</span> = num1.length<span style="color: #98be65;">()</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">length2</span> = num2.length<span style="color: #98be65;">()</span>;

        <span style="color: #ECBE7B;">int</span><span style="color: #98be65;">[]</span> <span style="color: #dcaeea;">pos</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">int</span><span style="color: #98be65;">[</span>length1 + length2<span style="color: #98be65;">]</span>;

        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = length1 - <span style="color: #da8548; font-weight: bold;">1</span>; i&gt;=<span style="color: #da8548; font-weight: bold;">0</span>; i--<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #51afef;">for</span><span style="color: #a9a1e1;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">k</span> = length2 -<span style="color: #da8548; font-weight: bold;">1</span>; k &gt;=<span style="color: #da8548; font-weight: bold;">0</span>; k--<span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">{</span>
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mulplyResult</span> = <span style="color: #51afef;">(</span>num1.charAt<span style="color: #c678dd;">(</span>i<span style="color: #c678dd;">)</span> - <span style="color: #98be65;">'0'</span><span style="color: #51afef;">)</span> * <span style="color: #51afef;">(</span>num2.charAt<span style="color: #c678dd;">(</span>k<span style="color: #c678dd;">)</span> - <span style="color: #98be65;">'0'</span><span style="color: #51afef;">)</span>;
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">p1</span> = k + i, <span style="color: #dcaeea;">p2</span> = k + i + <span style="color: #da8548; font-weight: bold;">1</span>;
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">sum</span> = pos<span style="color: #51afef;">[</span>p2<span style="color: #51afef;">]</span> + mulplyResult;
                pos<span style="color: #51afef;">[</span>p2<span style="color: #51afef;">]</span> = sum%<span style="color: #da8548; font-weight: bold;">10</span>;
                pos<span style="color: #51afef;">[</span>p1<span style="color: #51afef;">]</span> += sum/<span style="color: #da8548; font-weight: bold;">10</span>;
            <span style="color: #a9a1e1;">}</span>
        <span style="color: #98be65;">}</span>

        <span style="color: #ECBE7B;">StringBuilder</span> <span style="color: #dcaeea;">sb</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">StringBuilder</span><span style="color: #98be65;">()</span>;
        <span style="color: #51afef;">for</span><span style="color: #98be65;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">p</span> : pos<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #51afef;">if</span><span style="color: #a9a1e1;">(</span>sb.length<span style="color: #51afef;">()</span> == <span style="color: #da8548; font-weight: bold;">0</span> &amp;&amp; p == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #a9a1e1;">)</span> <span style="color: #51afef;">continue</span>;
            sb.append<span style="color: #a9a1e1;">(</span>p<span style="color: #a9a1e1;">)</span>;
        <span style="color: #98be65;">}</span>
        <span style="color: #51afef;">return</span> sb.toString<span style="color: #98be65;">()</span>;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
1   2   3     &lt;&lt;&lt;&lt; when i = 1, we take 2
3   4   5     &lt;&lt;&lt;&lt; when k = 2, we take 5
</p>
<hr />
<p>
1   0
</p>

<p>
[{0}|{1}|{2}|{3}|{4}|{5}]  &lt;&lt;&lt;&lt;&lt; p1 is bucket 3, p2 is bucket 4
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David</p>
<p class="date">Created: 2022-08-13 Sat 10:57</p>
</div>
</body>
</html>
